Documents/мегапрайсРегистрацияПрайса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>мегапрайсРегистрацияПрайса</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗагруженРоботом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрайсПартнера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мегапрайсПрофилиПрайсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПрайса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураПоставщиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПоставки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБезСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальноеКоличествоЗаказа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/мегапрайсЦеныНоменклатурыПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>мегапрайсЦеныНоменклатурыПоставщиков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальныйЗаказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПрайсПартнера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мегапрайсПрофилиПрайсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле_Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле_Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле_Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/мегапрайсРегистрацияПрайса/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//мегапрайсНеХранитьИсториюПрайсов = Константы.мегапрайсНеХранитьИсториюПрайсов.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	мегапрайсРегистрацияПрайса.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.мегапрайсРегистрацияПрайса КАК мегапрайсРегистрацияПрайса
	|ГДЕ
	|	мегапрайсРегистрацияПрайса.Проведен = ИСТИНА
	|	И мегапрайсРегистрацияПрайса.ПрайсПартнера = &ПрайсПартнера
	|	И мегапрайсРегистрацияПрайса.ИдентификаторПрайса <> &ИдентификаторПрайса
	|	И мегапрайсРегистрацияПрайса.Ссылка <> &ТекущийДокумент";
	
	Запрос.УстановитьПараметр("ПрайсПартнера", ПрайсПартнера);
	Запрос.УстановитьПараметр("ИдентификаторПрайса", ИдентификаторПрайса);
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	Пока РезультатЗапроса.Следующий() Цикл
		ПрайсПартнераОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		ПрайсПартнераОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);		
	КонецЦикла;
	
	Движения.мегапрайсЦеныНоменклатурыПоставщиков.Записывать = Истина;
	Движения.мегапрайсЦеныНоменклатурыПоставщиков.Очистить();

	//Если НЕ мегапрайсНеХранитьИсториюПрайсов Тогда 
	//	//Очистка значений предидущих прайсов о наличии товара	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	ИСТИНА КАК Актуальность,
	//	|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.ПрайсПартнера,
	//	|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.НоменклатураПоставщика КАК НоменклатураПоставщика,
	//	|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура КАК Номенклатура,
	//	|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//	|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.Валюта КАК Валюта,
	//	|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.СрокПоставки КАК СрокПоставки,
	//	|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.Количество КАК Количество,
	//	|	мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних.Цена КАК Цена
	//	|ИЗ
	//	|	РегистрСведений.мегапрайсЦеныНоменклатурыПоставщиков.СрезПоследних(
	//	|			&ДатаДок,
	//	|			ПрайсПартнера = &ПрайсПартнера
	//	|				И НЕ Номенклатура В (&СписокНоменклатурыПоставщика)
	//	|				И Количество > 0) КАК мегапрайсЦеныНоменклатурыПоставщиковСрезПоследних";
	//	
	//	Запрос.УстановитьПараметр("ДатаДок", ЭтотОбъект.Дата);
	//	Запрос.УстановитьПараметр("ПрайсПартнера", ПрайсПартнера);
	//	Запрос.УстановитьПараметр("СписокНоменклатурыПоставщика", Товары.ВыгрузитьКолонку("Номенклатура"));
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	ТаблицаЗаписей = РезультатЗапроса.Выгрузить();
	//	
	//	Для Каждого СтрокаТаблицы Из ТаблицаЗаписей Цикл
	//		НоваяЗапись = Движения.мегапрайсЦеныНоменклатурыПоставщиков.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТаблицы);
	//		НоваяЗапись.Регистратор  = Ссылка;
	//		НоваяЗапись.Период       = Дата;
	//		НоваяЗапись.Цена         = 0;
	//		НоваяЗапись.Количество   = 0;
	//		НоваяЗапись.СрокПоставки = 0;
	//	КонецЦикла;	
	//КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИСТИНА КАК Актуальность,
	|	ТаблицаЦены.Ссылка КАК ДокументРегистратор,
	|	ТаблицаЦены.Ссылка.Дата КАК Период,
	|	ТаблицаЦены.Ссылка.ПрайсПартнера КАК ПрайсПартнера,
	|	ТаблицаЦены.НоменклатураПоставщика КАК НоменклатураПоставщика,
	|	ТаблицаЦены.Номенклатура КАК Номенклатура,
	|	ТаблицаЦены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаЦены.Валюта КАК Валюта,
	|	МАКСИМУМ(ТаблицаЦены.СрокПоставки) КАК СрокПоставки,
	|	СУММА(ТаблицаЦены.Количество) КАК Количество,
	|	МАКСИМУМ(ТаблицаЦены.Цена) КАК Цена
	|ИЗ
	|	Документ.мегапрайсРегистрацияПрайса.Товары КАК ТаблицаЦены
	|ГДЕ
	|	ТаблицаЦены.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЦены.Ссылка.Дата,
	|	ТаблицаЦены.Ссылка.ПрайсПартнера,
	|	ТаблицаЦены.НоменклатураПоставщика,
	|	ТаблицаЦены.Номенклатура,
	|	ТаблицаЦены.ХарактеристикаНоменклатуры,
	|	ТаблицаЦены.Валюта,
	|	ТаблицаЦены.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗаписей = РезультатЗапроса.Выгрузить();
		
	Для Каждого СтрокаТаблицы Из ТаблицаЗаписей Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;

		НоваяЗапись = Движения.мегапрайсЦеныНоменклатурыПоставщиков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТаблицы);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Валюта) Тогда
			НоваяЗапись.Валюта = ПрайсПартнера.Валюта;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
